{"in": 902, "2024": 150, "there": 1097, "were": 1128, "920": 675, "foreign": 854, "born": 771, "residents": 1038, "from": 860, "denmark": 824, "living": 944, "massachusetts": 961, "10": 36, "amherst": 727, "town": 1101, "23": 180, "arlington": 733, "cdp": 794, "75": 580, "boston": 773, "103": 40, "boxford": 775, "109": 46, "brookline": 783, "13": 69, "burlington": 785, "buzzards": 787, "bay": 755, "96": 691, "cambridge": 790, "gloucester": 865, "104": 41, "lexington": 939, "16": 102, "malden": 954, "marblehead": 956, "mashpee": 960, "neck": 984, "nantucket": 983, "31": 262, "newton": 990, "north": 993, "adams": 717, "107": 44, "revere": 1039, "wellesley": 1127, "worcester": 1145, "12": 58, "836": 633, "ireland": 911, "113": 51, "abington": 715, "acushnet": 716, "center": 796, "agawam": 722, "29": 242, "amesbury": 726, "33": 280, "andover": 729, "133": 73, "42": 363, "attleboro": 739, "67": 531, "barnstable": 752, "79": 604, "belmont": 763, "22": 169, "beverly": 765, "855": 644, "365": 313, "braintree": 776, "36": 308, "brewster": 779, "bridgewater": 780, "304": 257, "brockton": 781, "51": 425, "337": 288, "28": 231, "chicopee": 800, "38": 327, "cochituate": 806, "18": 124, "cordaville": 811, "19": 135, "danvers": 819, "152": 94, "dedham": 820, "dover": 829, "east": 831, "brookfield": 782, "dennis": 825, "falmouth": 849, "sandwich": 1052, "everett": 845, "49": 413, "framingham": 857, "122": 61, "franklin": 859, "54": 451, "groton": 872, "72": 558, "haverhill": 883, "17": 113, "hingham": 886, "holbrook": 887, "46": 390, "holyoke": 890, "20": 146, "hopkinton": 894, "hudson": 898, "hull": 899, "ipswich": 908, "11": 47, "lawrence": 932, "15": 91, "lenox": 936, "45": 383, "26": 212, "longmeadow": 945, "37": 317, "lowell": 946, "lynn": 949, "lynnfield": 950, "madaket": 952, "64": 513, "mansfield": 955, "39": 338, "marlborough": 958, "14": 80, "marshfield": 959, "198": 144, "maynard": 963, "medfield": 964, "180": 125, "medford": 965, "151": 93, "melrose": 967, "methuen": 968, "middleborough": 971, "140": 81, "milford": 972, "millis": 974, "clicquot": 803, "194": 140, "milton": 976, "monument": 979, "beach": 756, "218": 167, "21": 158, "needham": 985, "35": 301, "new": 988, "bedford": 757, "newburyport": 989, "112": 50, "48": 406, "northampton": 994, "59": 486, "attleborough": 740, "24": 190, "plymouth": 1024, "seekonk": 1060, "121": 60, "norwood": 1001, "68": 537, "ocean": 1004, "bluff": 768, "brant": 777, "rock": 1042, "orleans": 1009, "90": 662, "peabody": 1016, "pittsfield": 1023, "854": 643, "quincy": 1032, "randolph": 1033, "reading": 1036, "53": 444, "salem": 1049, "salisbury": 1050, "106": 43, "scituate": 1055, "sharon": 1064, "smith": 1071, "mills": 975, "somerset": 1073, "118": 56, "somerville": 1074, "27": 223, "south": 1075, "81": 618, "yarmouth": 1146, "126": 65, "springfield": 1080, "50": 420, "stoneham": 1083, "32": 271, "swampscott": 1087, "47": 399, "taunton": 1093, "topsfield": 1100, "76": 586, "wakefield": 1118, "30": 253, "walpole": 1119, "200": 147, "waltham": 1120, "25": 201, "wareham": 1122, "142": 83, "watertown": 1125, "west": 1129, "chatham": 798, "74": 575, "concord": 809, "weymouth": 1135, "wilmington": 1139, "89": 659, "winchester": 1141, "144": 85, "winthrop": 1142, "77": 592, "woburn": 1143, "63": 507, "port": 1028, "303": 256, "norway": 1000, "mattapoisett": 962, "658": 522, "sweden": 1088, "34": 291, "213": 162, "117": 55, "clinton": 804, "greenfield": 869, "166": 109, "saugus": 1054, "westborough": 1130, "williamstown": 1138, "434": 373, "united": 1109, "kingdom": 922, "excluding": 846, "england": 840, "and": 728, "scotland": 1056, "61": 495, "99": 710, "baldwinville": 749, "62": 503, "520": 436, "551": 460, "641": 514, "chelsea": 799, "harwich": 880, "fall": 847, "river": 1041, "fitchburg": 852, "127": 66, "great": 867, "barrington": 754, "hatfield": 881, "73": 565, "housatonic": 895, "huntington": 901, "58": 478, "kingston": 923, "leominster": 937, "163": 106, "169": 112, "52": 435, "69": 544, "115": 53, "83": 627, "378": 325, "188": 133, "northborough": 995, "lakeville": 927, "pembroke": 1017, "westport": 1133, "oxford": 1012, "93": 676, "57": 471, "rockport": 1043, "rowley": 1045, "sagamore": 1048, "71": 554, "227": 177, "sturbridge": 1084, "the": 1096, "pinehills": 1021, "60": 490, "92": 674, "250": 202, "65": 518, "westfield": 1132, "280": 232, "whitinsville": 1136, "141": 82, "135": 75, "381": 329, "209": 157, "athol": 738, "ayer": 744, "belchertown": 759, "716": 557, "bourne": 774, "264": 217, "212": 161, "44": 379, "duxbury": 830, "easthampton": 834, "125": 64, "forestdale": 855, "97": 699, "41": 356, "40": 347, "78": 600, "82": 624, "94": 681, "271": 225, "158": 100, "eastham": 833, "95": 687, "provincetown": 1031, "179": 123, "111": 49, "seabrook": 1057, "seconsett": 1059, "island": 912, "deerfield": 821, "132": 72, "turners": 1105, "falls": 848, "56": 464, "webster": 1126, "108": 45, "119": 57, "woods": 1144, "hole": 888, "784": 602, "55": 459, "barre": 753, "80": 611, "holland": 889, "139": 79, "millers": 973, "northwest": 998, "siasconset": 1067, "southbridge": 1076, "teaticket": 1094, "978": 702, "other": 1010, "northern": 996, "europe": 844, "700": 550, "austria": 743, "98": 703, "43": 369, "orange": 1008, "281": 233, "belgium": 760, "253": 205, "201": 148, "pocasset": 1025, "shelburne": 1065, "87": 650, "975": 700, "france": 858, "184": 129, "293": 246, "204": 152, "900": 663, "cedar": 795, "crest": 814, "149": 90, "85": 639, "269": 222, "205": 153, "vineyard": 1117, "haven": 882, "105": 42, "850": 640, "germany": 863, "129": 68, "147": 88, "bliss": 767, "corner": 812, "624": 504, "187": 132, "635": 510, "essex": 842, "fiskdale": 851, "gardner": 861, "granby": 866, "lee": 935, "191": 137, "159": 101, "100": 37, "533": 447, "palmer": 1014, "162": 105, "raynham": 1035, "343": 294, "upton": 1110, "110": 48, "138": 78, "164": 107, "warren": 1123, "weweantic": 1134, "270": 224, "netherlands": 987, "186": 131, "norton": 999, "363": 311, "794": 607, "switzerland": 1089, "364": 312, "seabury": 1058, "84": 634, "western": 1131, "409": 355, "greece": 868, "207": 155, "840": 635, "215": 164, "196": 142, "172": 116, "157": 99, "244": 195, "283": 235, "182": 127, "nahant": 982, "66": 524, "223": 173, "183": 128, "146": 87, "spencer": 1079, "222": 172, "234": 185, "130": 70, "91": 666, "294": 247, "055": 20, "italy": 915, "192": 138, "bellingham": 762, "738": 573, "420": 364, "664": 527, "devens": 826, "417": 360, "hopedale": 893, "lunenburg": 948, "171": 115, "hills": 885, "852": 642, "160": 103, "148": 89, "199": 145, "527": 442, "318": 269, "pinehurst": 1022, "980": 704, "189": 134, "387": 335, "195": 141, "242": 193, "338": 289, "399": 346, "367": 315, "202": 149, "portugal": 1029, "128": 67, "688": 542, "510": 426, "488": 411, "493": 416, "418": 361, "374": 321, "004": 1, "412": 358, "291": 244, "792": 606, "120": 59, "566": 470, "116": 54, "438": 377, "370": 318, "556": 463, "052": 19, "818": 623, "grove": 873, "805": 613, "174": 118, "272": 226, "508": 423, "150": 92, "421": 365, "143": 84, "877": 652, "azores": 746, "islands": 913, "240": 191, "86": 646, "407": 353, "211": 160, "295": 248, "249": 200, "466": 397, "711": 555, "spain": 1078, "962": 694, "489": 412, "124": 63, "216": 165, "northfield": 997, "153": 95, "southern": 1077, "252": 204, "albania": 723, "311": 264, "352": 303, "571": 472, "287": 239, "228": 178, "289": 241, "750": 581, "565": 469, "389": 337, "181": 126, "544": 454, "284": 236, "248": 199, "258": 210, "545": 455, "belarus": 758, "302": 255, "193": 139, "bosnia": 772, "herzegovina": 884, "70": 549, "268": 221, "217": 166, "832": 629, "bulgaria": 784, "257": 209, "177": 121, "509": 424, "croatia": 815, "114": 52, "742": 578, "czechoslovakia": 818, "includes": 903, "czech": 817, "republic": 1037, "slovakia": 1070, "241": 192, "572": 473, "hungary": 900, "foxborough": 856, "957": 690, "latvia": 931, "049": 18, "lithuania": 942, "88": 653, "moldova": 977, "190": 136, "popponesset": 1027, "137": 77, "329": 279, "498": 419, "macedonia": 951, "poland": 1026, "672": 532, "035": 14, "145": 86, "monson": 978, "onset": 1007, "208": 156, "ware": 1121, "165": 108, "660": 525, "romania": 1044, "123": 62, "355": 304, "littleton": 943, "common": 808, "484": 409, "russia": 1046, "206": 154, "131": 71, "235": 186, "986": 708, "639": 512, "393": 342, "231": 182, "458": 389, "136": 76, "288": 240, "525": 440, "342": 293, "346": 297, "rutland": 1047, "461": 392, "423": 366, "588": 484, "214": 163, "631": 509, "468": 398, "serbia": 1062, "ukraine": 1107, "332": 283, "155": 97, "102": 39, "963": 695, "349": 300, "306": 259, "330": 281, "324": 275, "810": 619, "667": 529, "628": 506, "731": 566, "eastern": 832, "486": 410, "326": 276, "225": 175, "china": 802, "hong": 892, "kong": 924, "taiwan": 1091, "960": 692, "197": 143, "273": 227, "728": 564, "911": 667, "101": 38, "659": 523, "696": 547, "210": 159, "524": 439, "328": 278, "992": 712, "313": 265, "hanscom": 878, "afb": 719, "372": 320, "335": 286, "333": 284, "375": 322, "089": 32, "246": 197, "686": 541, "047": 17, "260": 213, "pepperell": 1018, "317": 268, "646": 516, "644": 515, "391": 340, "229": 179, "361": 310, "251": 203, "424": 367, "917": 671, "578": 476, "933": 678, "wilbraham": 1137, "winchendon": 1140, "319": 270, "298": 251, "706": 552, "377": 324, "480": 407, "238": 188, "740": 576, "063": 24, "168": 111, "167": 110, "170": 114, "770": 593, "243": 194, "366": 314, "585": 483, "394": 343, "348": 299, "512": 427, "townsend": 1102, "462": 393, "851": 641, "japan": 918, "134": 74, "830": 628, "904": 664, "386": 334, "844": 637, "korea": 925, "259": 211, "265": 218, "754": 583, "230": 181, "549": 458, "739": 574, "232": 183, "785": 603, "356": 305, "296": 249, "asia": 736, "afghanistan": 720, "529": 443, "bangladesh": 750, "790": 605, "657": 521, "322": 274, "755": 584, "bhutan": 766, "383": 331, "011": 5, "india": 905, "541": 452, "350": 302, "610": 496, "390": 339, "161": 104, "384": 332, "185": 130, "560": 465, "937": 679, "526": 441, "630": 508, "261": 214, "305": 258, "344": 295, "779": 599, "400": 348, "307": 260, "315": 266, "274": 228, "478": 405, "266": 219, "613": 499, "968": 697, "430": 370, "088": 31, "799": 610, "iran": 909, "385": 333, "154": 96, "774": 595, "kazakhstan": 920, "405": 351, "nepal": 986, "916": 670, "278": 230, "506": 422, "256": 208, "pakistan": 1013, "436": 375, "496": 417, "267": 220, "220": 170, "781": 601, "sri": 1081, "lanka": 929, "863": 648, "uzbekistan": 1112, "central": 797, "497": 418, "burma": 786, "myanmar": 981, "245": 196, "874": 651, "cambodia": 789, "447": 381, "627": 505, "932": 677, "285": 237, "263": 216, "834": 631, "indonesia": 907, "334": 285, "219": 168, "247": 198, "laos": 930, "032": 13, "malaysia": 953, "522": 437, "philippines": 1020, "176": 120, "203": 151, "221": 171, "singapore": 1069, "808": 616, "thailand": 1095, "455": 387, "845": 638, "465": 396, "vietnam": 1115, "233": 184, "912": 668, "946": 685, "583": 481, "007": 3, "605": 492, "584": 482, "724": 561, "519": 434, "778": 598, "733": 568, "092": 33, "armenia": 734, "448": 382, "359": 307, "azerbaijan": 745, "369": 316, "577": 475, "georgia": 862, "156": 98, "iraq": 910, "237": 187, "005": 2, "israel": 914, "532": 446, "jordan": 919, "001": 0, "kuwait": 926, "347": 298, "lebanon": 934, "435": 374, "379": 326, "683": 540, "382": 330, "451": 384, "saudi": 1053, "arabia": 731, "syria": 1090, "340": 292, "388": 336, "617": 502, "turkey": 1104, "277": 229, "437": 376, "518": 433, "arab": 730, "emirates": 839, "300": 254, "yemen": 1147, "689": 543, "734": 569, "edgartown": 836, "707": 553, "eritrea": 841, "842": 636, "ethiopia": 843, "764": 589, "538": 450, "kenya": 921, "991": 711, "309": 261, "224": 174, "056": 21, "513": 428, "somalia": 1072, "tanzania": 1092, "uganda": 1106, "888": 657, "656": 520, "zimbabwe": 1150, "africa": 721, "432": 371, "292": 245, "cameroon": 791, "404": 350, "668": 530, "congo": 810, "democratic": 823, "of": 1006, "zaire": 1148, "282": 234, "middle": 970, "553": 461, "algeria": 724, "173": 117, "egypt": 837, "morocco": 980, "579": 477, "477": 404, "530": 445, "376": 323, "331": 282, "sudan": 1086, "984": 707, "cabo": 788, "verde": 1114, "890": 660, "hanson": 879, "722": 559, "439": 378, "797": 608, "ghana": 864, "816": 621, "694": 545, "299": 252, "554": 462, "736": 571, "ivory": 916, "coast": 805, "liberia": 940, "062": 23, "741": 577, "nigeria": 992, "998": 714, "682": 539, "336": 287, "286": 238, "943": 683, "senegal": 1061, "070": 27, "sierra": 1068, "leone": 938, "500": 421, "320": 272, "togo": 1099, "476": 403, "535": 448, "665": 528, "821": 625, "australia": 741, "380": 328, "327": 277, "lancaster": 928, "887": 656, "australian": 742, "zealand": 1149, "subregion": 1085, "fiji": 850, "oceania": 1005, "402": 349, "bahamas": 748, "barbados": 751, "695": 546, "226": 176, "757": 585, "cuba": 816, "835": 632, "976": 701, "dominica": 827, "655": 519, "dominican": 828, "964": 696, "460": 391, "918": 672, "515": 430, "737": 572, "815": 620, "800": 612, "961": 693, "071": 28, "949": 686, "593": 489, "705": 551, "414": 359, "862": 647, "310": 263, "095": 34, "grenada": 870, "haiti": 877, "601": 491, "028": 10, "573": 474, "833": 630, "697": 548, "452": 385, "723": 560, "881": 654, "marion": 957, "798": 609, "908": 665, "456": 388, "474": 401, "614": 500, "726": 562, "953": 688, "175": 119, "899": 661, "jamaica": 917, "647": 517, "767": 590, "475": 402, "239": 189, "772": 594, "st": 1082, "lucia": 947, "vincent": 1116, "grenadines": 871, "trinidad": 1103, "tobago": 1098, "563": 467, "178": 122, "indies": 906, "caribbean": 793, "belize": 761, "345": 296, "costa": 813, "rica": 1040, "762": 588, "464": 395, "el": 838, "salvador": 1051, "254": 206, "397": 344, "067": 26, "608": 494, "398": 345, "542": 453, "371": 319, "661": 526, "589": 485, "029": 11, "547": 457, "760": 587, "408": 354, "ashburnham": 735, "777": 597, "guatemala": 874, "817": 622, "869": 649, "581": 479, "030": 12, "546": 456, "882": 655, "honduras": 891, "392": 341, "732": 567, "942": 682, "021": 7, "mexico": 969, "321": 273, "425": 368, "470": 400, "nicaragua": 991, "panama": 1015, "677": 536, "297": 250, "america": 725, "919": 673, "411": 357, "argentina": 732, "453": 386, "bolivia": 770, "brazil": 778, "561": 466, "638": 511, "433": 372, "079": 30, "360": 309, "889": 658, "255": 207, "358": 306, "444": 380, "020": 6, "073": 29, "492": 415, "680": 538, "727": 563, "914": 669, "517": 432, "262": 215, "776": 596, "856": 645, "564": 468, "chile": 801, "675": 534, "829": 626, "colombia": 807, "591": 488, "058": 22, "339": 290, "523": 438, "shirley": 1066, "807": 615, "316": 267, "ecuador": 835, "676": 535, "463": 394, "611": 497, "008": 4, "938": 680, "guyana": 875, "066": 25, "peru": 1019, "806": 614, "481": 408, "uruguay": 1111, "809": 617, "590": 487, "venezuela": 1113, "oak": 1002, "bluffs": 769, "768": 591, "canada": 792, "987": 709, "490": 414, "406": 352, "households": 897, "owner": 1011, "occupied": 1003, "share": 1063, "was": 1124, "unemployment": 1108, "rate": 1034, "for": 853, "median": 966, "household": 896, "income": 904, "954": 689, "982": 706, "748": 579, "615": 501, "673": 533, "040": 15, "419": 362, "043": 16, "606": 493, "981": 705, "582": 480, "969": 698, "753": 582, "714": 556, "adults": 718, "had": 876, "at": 737, "least": 933, "bachelor": 747, "degree": 822, "098": 35, "022": 8, "024": 9, "516": 431, "944": 684, "735": 570, "996": 713, "514": 429, "536": 449, "612": 498, "290": 243, "below": 764, "poverty": 1030, "line": 941}